Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བྱ་བ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དང་པོ་སེམས་བསྐྱེད་པ་ནས་མོས་པས་སྤྱོད་པའི་ས་ནས་བཟུང་སྟེ། ས་ཆོས་ཀྱི་སྤྲིན་ལ་ཐུག་གི་བར་དུ་ཀུན་དུ་འགྲོ་བའི་དོན་དང་། མཆོག་གི་དོན་ལ་སོགས་པ་རབ་ཏུ་རྟོགས་པས་དེ་བཞིན་ཉིད་རྣམ་པར་སྤྱོད་པ་ལ་ཞུགས་པ་གནས་གྱུར་པའི་རྒྱུར་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱེད་པ་སྟེ། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བྱའོ།
en: The knowledge of path aspects”: Here, from the first production of the thought of awakening on the devoted course of conduct level up to the Dharmameghā level, the knowledge operating as insight by penetrating into suchness in the omnipresent sense, the tip sense, and so on, which acts to cause the transformation of the basis, operates for the happiness and benefit of beings, and causes bodhisattvas to reach the great city of the knowledge of all aspects is called the knowledge of path aspects. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་ནི། སངས་རྒྱས་རྣམས་ཀྱི་ཡེ་ཤེས་ནམ་མཁའི་ཁམས་ཀྱི་མཐས་གཏུགས་པའི་སེམས་ཅན་གྱི་དོན་གྱི་རྒྱུན་མ་བཅད་པ། ཆོས་ཀྱི་སྐུ་རབ་ཏུ་རྟོགས་པ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་རབ་ཏུ་སྤངས་པ་འབྲས་བུའི་ཡེ་ཤེས་ཏེ། ཆོས་ཐམས་ཅད་ལ་རྣམ་པ་ཐམས་ཅད་དུ་ཞུགས་པའི་འབྲས་བུ་ཡིན་པའི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱའོ།
en: The knowledge of all aspects” is the knowledge of buddhas as far-reaching as the space element, for the welfare of beings without interruption, that realizes the body of dharmas—a resultant knowledge of the abandonment of residual impression connections called the knowledge of all aspects because it is the result of having comprehended all dharmas in all aspects. “

source: །རབ་འབྱོར་རྣམ་པ་གཅིག་གིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་སྟེ་འདི་ལྟར་ཞི་བའི་རྣམ་པས་ཞེས་བྱ་བ་ནི་གང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཡོངས་སུ་རྟོགས་པ་དང་།
en: Subhūti, that one aspect on account of which… [it] is called ‘knowledge of all aspects’ is thus the calm aspect.”

source: རྣམ་པར་རྟོག་པའི་རྣམ་པ་ཐམས་ཅད་རབ་ཏུ་ནུབ་ཅིང་སེམས་ཅན་གྱི་འཇིག་རྟེན་དང་། སྣོད་ཀྱི་འཇིག་རྟེན་མཐའ་དག་དང་། བྲལ་བ་ཁམས་གསུམ་དུ་གཏོགས་པའི་ཚུལ་ཁྲིམས་ཀྱིས་རྣམ་པར་རྟོག་པའི་སྤྲོས་པའི་དྲ་བ་འགགས་པར་གྱུར་པ་ན། ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་ཀྱི་རྣམ་པར་ཞུགས་པ་ལྷུན་གྱིས་གྲུབ་པའི་ཆོས་ཀྱི་སྐུའི་བདག་ཉིད་ཤིན་དུ་ཞི་བའི་རྣམ་པ་གང་ཡིན་པ་དེ། ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཡིན་པའི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་ཅེས་བྱ་སྟེ།
en: That aspect the tathāgatas comprehend, the subsiding of all the aspects of the conceptualizations separated entirely from the world as beings and from the container world, when the morality encompassing the three realms has stopped the net of conceptual thought—that which is the extremely calm aspect that constitutes the spontaneous body of dharmas that is the absolutely pure dharma-constituent accessed as a sameness—is the aspect of all dharmas, hence “all aspects.”

source: རྣམ་པ་དེ་ལྟ་བུར་ཞུགས་པའི་ཡེ་ཤེས་ཀྱི་རང་བཞིན་དེ་ལྟ་བུ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱའོ།
en: The knowledge entity of the sort that has accessed such an aspect is called the knowledge of all aspects. “

source: །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྤངས་པ་ཞེས་བྱ་བ་ནི་ལས་དང་ཉོན་མོངས་པའི་རྣམ་པར་རྟོག་པའི་བག་ཆགས་རྣམས་ལས། འདིར་སེམས་ཅན་རྣམས་ཀྱི་རྒྱུ་དང་འབྲས་བུ་གཅིག་ནས་གཅིག་ཏུ་བར་མ་ཆད་པར་འབྱུང་བ་གང་ཡིན་པ་དེ། རྒྱུན་ཆད་པ་ལ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྤངས་པ་ཞེས་བྱའོ།
en: An abandonment of all residual impression connections”— from among the residual impressions left by action and conceptual affliction, here cutting the continuum of the uninterrupted arising, one to the next, of cause and effect is called the abandonment of all residual impression connections. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་པར་ཉོན་མོངས་པ་སྤངས་པ་འདུས་མ་བགྱིས་ལགས་སམ་ཞེས་བྱ་བ་ནི་འགོག་པའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར་དེ་སྐད་གསུངས་ཏེ།
en: Before reaching the knowledge of all aspects is there an uncompounded abandonment of afflictions?” [The Lord] says [there is] because it is in the form of a cessation.

source: འགོག་པ་ནི་སྤོང་བ་ཙམ་དུ་ཟད་པས། ལུས་དང་ངག་གི་འགྱུར་བ་དག་ནི་འབྱུང་ངོ་།
en: He says, nevertheless, the cessation is simply just an abandonment, so “they still do odd things with their bodies and voices.

source: །དེ་དག་ཀྱང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་གནོད་པར་འགྱུར་བ་ནི་མ་ཡིན་ཞེས་བྱ་བ་ནི་མེ་ལོང་ལ་ལྟ་བ་དང་། མཆོང་ཞིང་འགྲོ་བ་ལ་སོགས་པ་དང་། པི་ལིན་ད་བད་སས་དམངས་མོའི་ཚིག་བརྗོད་པ་བཞིན་ཏེ།
en: These are not even bad in ordinary persons,” like gazing in a mirror, hopping while walking, and Pilindavatsa’s use of a word for a low caste woman.

source: དེ་དག་ཀྱང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་སམ་འཕགས་པ་རྣམས་གང་ལ་ཡང་གནོད་པར་ནི་མི་འགྱུར་རོ།
en: These are not bad, whether for an ordinary person or a noble person. “

source: །ཅི་ལམ་ལ་གནས་ཏེ་འམ།
en: Do bodhisattvas actualize the very limit of reality having stood on a path… or having stood on what is not a bad path?”

source: ལམ་མ་ཡིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པའི་རྣམ་པར་རྟོག་པ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་སླར་བཀའ་སྩལ་ཏེ།
en: and so on.

source: ལམ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པས་གནས་སུ་མི་རུང་ངོ་ཞེས་བྱ་བའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་ལམ་དངོས་པོ་མ་མཆིས་ལ། མྱ་ངན་ལས་འདས་པ་ཡང་དངོས་པོ་མ་མཆིས་ན། འོ་ན་ཅིའི་སླད་དུ་འདི་སྐད་དུ་འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ།
en: The Lord again says about the possibilities that “they cannot stand on the path because it is the nonexistence of an intrinsic nature.” “

source: །འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བའོ་ཞེས་བཤད་ཅེས་བྱ་བ་ལ་སོགས་པས། འཕགས་པའི་གང་ཟག་རྣམས་དང་སངས་རྒྱས་བཤད་པ། ལམ་གྱི་དབང་གིས་བཤད་དམ། མྱ་ངན་ལས་འདས་པ་ཐོབ་པས་བཤད་གྲང་ན། གལ་ཏེ་གཉི་ག་མེད་ན་འཕགས་པའི་གང་ཟག་ཇི་ལྟར་རྣམ་པར་འགོད་ཅེས་དགོངས་པའོ།
en: Lord, if the path is not an existent thing and nirvāṇa is not an existent thing, why is it taught that ‘this is a stream enterer; this is a once-returner,’ ” and so on, intends that you can suppose about the explanations of noble persons and of buddhas that they are explanations based on the path, or explanations because of having reached nirvāṇa, but if there are neither, how is there going to be a presentation of noble persons? “

source: །རབ་འབྱོར་དེ་དག་ཐམས་ཅད་ཀྱང་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའོ་ཞེས་བྱ་བ་ནི་ལམ་དང་མྱ་ངན་ལས་འདས་པ་གཉིས་མེད་དུ་ཟིན་ཀྱང་། འདུས་བྱས་མེད་པའི་རང་བཞིན་དེ་བཞིན་ཉིད་ཀྱིས་རབ་ཏུ་ཕྱེ་བའོ་ཞེས་སླར་བཀའ་སྩལ་པའོ།
en: Subhūti… all of these are categories of the uncompounded.” He again says that even though both a path and nirvāṇa are nonexistent they are categories of the suchness that is the basic nature of the uncompounded. “

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་འདུས་མ་བགྱིས་པ་དེ་འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ་ཞེས་རབ་ཏུ་འབྱེད་པ་མཆིས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བས་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའོ་ཞེས་དགོངས་ན། ཅི་འདུས་མ་བྱས་པ་དེ་གང་ཟག་དེ་དག་རབ་ཏུ་འབྱེད་དམ། སྐྱེད་པར་འགྱུར་རམ་ཞེས་ཞུས་པའོ།
en: Lord, does something uncompounded make the categories ‘this is a stream enterer’,” and so on, is asking—intending the “categories of the uncompounded”—whether the uncompounded makes, or produces, those categories of persons. “

source: །རབ་འབྱོར་འདུས་མ་བྱས་ནི་རབ་ཏུ་འབྱེད་པ་མེད་མོད་ཀྱི་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་སྐྱེད་པར་མི་བྱེད་མོད་ཀྱི། འོན་ཀྱང་གནས་གྱུར་པའི་དབང་གིས་དེ་བཞིན་ཉིད་ལ་འཇུག་པའི་བྱེ་བྲག་དང་། ཉོན་མོངས་པ་བག་ལ་ཉལ་བར་སྤོང་བའི་བྱེ་བྲག་གིས་དེ་དག་དེ་ལྟ་དེ་ལྟ་བུར་འགྱུར་བའི་ཕྱིར་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའོ་ཞེས་བཤད་དོ་ཞེས་བསྟན་པའོ།
en: Subhūti, the uncompounded does not make categories,” and so on, teaches that even though the uncompounded is not the producer, still, because of the special feature of entering into suchness through the power of the transformation of the basis, and the special feature of the abandonment of latent affliction, this or that sort of person comes about. “

source: །བཅོམ་ལྡན་འདས་འོ་ན་ཇི་ལྟར་འཁོར་བའི་ཕྱི་མའི་མཐའ་མཆིས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་སྔར་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ལ་སོགས་པ་བཤད་པ་ལས། འཁོར་བ་མེད་དོ་ཞེས་འཁོར་བའི་ཐོག་མ་དང་། ཐ་མ་དང་། དབུས་དམིགས་སུ་མེད་པ་སྨོས་ལ།
en: Lord, how will there be a later limit of saṃsāra?” Earlier, in the explanation of the emptiness of no beginning and no end, it said “there is no saṃsāra,” about the unfindable beginning, middle, and end of saṃsāra.

source: ད་ནི་དགྲ་བཅོམ་པ་དག་འདུས་མ་བྱས་ཀྱིས་རབ་ཏུ་ཕྱེ་བར་འགྱུར་ན། འཁོར་བའི་ཕྱི་མའི་མཐའ་ཡོད་པར་འགྱུར་རོ་སྙམ་དུ་དགོངས་ནས་ཞུས་པའོ།
en: Now it asks this, intending that if the worthy ones are categories of the uncompounded there will be an end to saṃsāra. “

source: །རབ་འབྱོར་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཚད་མར་བྱས་ཀྱི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་སོ་སོ་སྐྱེ་བོ་རྣམས་དང་།
en: Having taken ordinary convention as the authority, they are simply spoken about, even though ultimately there cannot be categories.”

source: དགྲ་བཅོམ་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ནི་དུས་ཐམས་ཅད་དུ་འཇུག་པའི་ཕྱིར་ཕྱི་མའི་མཐའ་མེད་མོད་ཀྱི། འོན་ཀྱང་གང་ཕུང་པོ་ལྔ་ཞེས་བྱ་བ་ཀུན་བརྟགས་པའི་ཆོས་དེ། རྒྱུན་ཆད་པ་ཉེ་བར་བཟུང་ནས་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་དེ་ལྟ་བུ་དག་བཤད་དོ་ཞེས་བསྟན་པའོ།
en: This is teaching that the suchness of ordinary persons and worthy ones is there at all times so there is no later limit, but still, having taken the cutting of the continuum of those falsely imagined dharmas called “the five aggregates” as its point of departure, it explains like that according to ordinary convention.

source: །དེ་བས་ན་གང་དང་གང་གིས་མཐའ་ཆད་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “those for whom an end is demarcated.” “

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས་ན།
en: Lord, if in all dharmas empty of their own marks a prior limit is not apprehended, what need is there to say more about a later limit?”

source: ཕྱི་མའི་མཐའ་སྨོས་ཀྱང་ཅི་འཚལ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པ་ཕུང་པོ་ལྔའི་ཆོས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་སྟེ། སྒྱུ་མ་ལྟ་བུ་ཡིན་པའི་ཕྱིར་དེ་དག་སྐྱེ་བའི་འདུ་ཤེས་ཅན་རྣམས་ཀྱི་སྔོན་གྱི་མཐའ་ཡང་མེད་ན།
en: This is saying the falsely imagined phenomena, the five aggregate “dharmas, are empty of their own marks” because they are the nonexistence of an intrinsic nature and hence are like an illusion.

source: འགག་པའི་འདུ་ཤེས་ཅན་རྣམས་ཀྱི་ཕྱི་མའི་མཐའ་ལྟ་ག་ལ་ཡོད་ཅེས་གསུངས་པའོ།
en: So, given that there is no “prior limit” of them perceived as being produced, “what need is there to say more about a later limit” when they are perceived as stopping? “

source: །དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པའི་ཕྱིར་དེའི་ཚིག་ལ་རྗེས་སུ་ཡི་རང་བའོ།
en: He rejoices in his statement because all dharmas are not produced and do not stop.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དམ་པ་སྟེ། དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ་ཞེས་བྱ་བ་ལ།
en: The meaning of pāramitā “Subhūti… this perfection of wisdom is, of all dharmas, perfect; therefore, it is called perfection of wisdom.”

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་འདིར་རྣམ་པར་རྟོག་པའི་དོན་བཞི་ཡོད་དེ་རེ་ཞིག་དང་པོར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་སྒྲ་དང་དོན་མཚུངས་པ་པ་མཐའ་ཞེས་བྱ་བའི་སྒྲ་ཡང་ཡོད་དེ།
en: There are four alternative meanings of pāramitā. Among them, first, similar in meaning to the word parama (ultimate), there is the word parami. An abstract noun “superiority” (pārami) is derived from that.

source: ཕ་མཐའི་དངོས་པོ་ལ་ནི་ཕ་རོལ་ཉིད་ཅེས་བྱའོ། །ཆོས་ཐམས་ཅད་ཀྱི་ཕ་མཐར་གྱུར་ཅིང་ཆོས་ཐམས་ཅད་ཀྱི་མཐར་ཐུག་པར་གནས་པའི་ཕྱིར་ཕ་རོལ་ཉིད་ཅེས་བྱའོ།
en: It says “superiority” because it is in the form of the limit of all dharmas and all dharmas culminate in it.

source: །ལུང་ལས་ཀྱང་། དངོས་པོའི་རྐྱེན་ཐ་མ་ན་ཡོད་ཀྱང་ཆོས་ཁོ་ནར་བརྗོད་དེ། དཔེར་ན་ཆུའི་ཁམས་གཤེར་བ་ལ་ཆུའི་ཁམས་གཤེར་བ་ཉིད་དོ་ཞེས་བྱ་བ་ལྟ་བུ་སྟེ།
en: The received tradition says, “Also when a suffix that makes an abstract noun [like -tā] is at the end it expresses just the thing itself, as, for example, saying of running water, ‘the water element’s fluidity.’ ”

source: དེ་བས་ན་རབ་འབྱོར་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཉིད་དམ་པའོ་ཞེས་གསུངས་ཏེ།
en: Hence it says, “Subhūti, this is the ultimate (parama) superiority (pārami-tā) of all dharmas.”

source: ཆོས་ཐམས་ཅད་ཀྱི་ཤིན་ཏུ་ཕ་རོལ་ཉིད་མཐར་ཐུག་པའི་ཕ་རོལ་ཉིད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that it is extremely superior, it is the final superiority of all dharmas.

source: །ཡང་ན་ཕ་རོལ་ཞེས་བྱ་བ་ནི་མཐའོ། །ཕྱིན་པ་ནི་སོན་པ་སྟེ།
en: Alternatively, pāram (farther shore) means limit and ita means gone.

source: དེའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: Hence pāramitā, “gone to the other side.”

source: །དེ་བས་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་འདིས་ཕ་རོལ་དུ་སོན་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “with this… all śrāvakas, pratyekabuddhas, bodhisattva great beings, and tathāgatas, worthy ones, perfectly complete buddhas have reached the other side.”

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་འགྲོ་བར་བྱེད་པའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: It is called perfection because it causes them to go to the farther shore.

source: །ཡང་ན་དམ་པའི་སྒྲ་ནི་དོན་དམ་པ་ལ་བྱ་སྟེ།
en: Alternatively, construe the word parama (perfect) with paramārtha (the ultimate).

source: དམ་པ་ལས་བྱུང་བའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དོན་དམ་པ་ལ་དམིགས་པ་ལས་བྱུང་བའི་ཕྱིར་དམ་པ་ལས་བྱུང་བ་ཞེས་བྱའོ།
en: Because it arises from the ultimate it is an understanding of the ultimate (pāramitā); it comes about with the ultimate as its objective support.

source: །མི་གནས་པའི་མྱ་ངན་ལས་འདས་པའི་མཚན་ཉིད་དོན་དམ་པ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་རང་བཞིན་ལ་དམིགས་ནས་བྱུང་བའི་ཤེས་རབ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The wisdom that has arisen having taken as its objective support the basic nature marked by nonabiding nirvāṇa, which is the ultimate sameness of all dharmas, is the perfection of wisdom.

source: དེ་བས་ན་དོན་དམ་པར་ཆོས་ཐམས་ཅད་དབྱེར་མེད་པའི་དོན་གང་ཡིན་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says, “Also, Subhūti, with this perfection of wisdom the tathāgata has fully awakened to the fact that all dharmas are not ultimately different; therefore, it is called perfection of wisdom.”

source: ཤེས་རབ་ནི་དོན་དམ་པ་ལ་དམིགས་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་དོན་དམ་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The wisdom has the ultimate as its objective support so the tathāgatas have fully awakened to the ultimate.

source: །ཡང་ན་ཕ་རོལ་གྱི་སྒྲ་ནི་དེ་བཞིན་ཉིད་ལ་བྱ་སྟེ། ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་གྱུར་པའི་ཕྱིར་རོ།
en: Alternatively, construe the word pāra (farthest limit) with suchness, because it is the farthest limit of everything.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པར་གྱུར་པ་དེ་བཞིན་ཉིད་ཐོབ་པ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: The wisdom that has gone into the farthest limit, has reached suchness, is said to be perfection (pāramitā).

source: །དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིར་དེ་བཞིན་ཉིད་ཀྱང་ཆུད། མ་ནོར་བ་དེ་བཞིན་ཉིད་ཀྱང་ཆུད་ཅེས་གསུངས་སོ།
en: Therefore, it says, “gone into this perfection of wisdom is suchness, and gone into it also is unmistaken suchness.”

source: །དེ་བཞིན་ཉིད་ལ་སོགས་པ་འདིར་ཆུད་པའི་ཕྱིར་འདི་ནི་དེ་བཞིན་ཉིད་ལ་སོགས་པ་ལ་ཁྱབ་པར་གྱུར་པ་ཞེས་བྱ་བའི་མིང་ཅན་ཡིན་ནོ།
en: Because gone into it are suchness and so on, it is said that it has extended over suchness and so on. “

source: །ལྡན་པའམ་མི་ལྡན་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་འདིས་མན་ཆད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་འབའ་ཞིག་སྟོན་ཏོ།
en: Neither conjoined with nor disjoined from,” and so on—up to here, the explanation has been of just the intrinsic nature of the perfection of wisdom. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་སྤྱོད་པར་བྱེད་པའོ། །སྤོབས་པ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་པའོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་སྤྱོད་ཅིང་། ཤེས་པ་ཐམས་ཅད་སྐྱེད་པར་བྱེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ། །འདི་ལྟར་སྤྱོད་པར་བྱེད་པ་གང་ཡིན་པ་དང་། གང་གི་ཚེ་སྤྱོད་པ་དང་།
en: This perfection of wisdom causes the practice of all dharmas, this perfection of wisdom bestows all confidences” means the practice of all dharmas causing the production of all knowledges. “

source: ཇི་ལྟར་སྤྱོད་པ་དེ་དག་ཐམས་ཅད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་མི་དམིགས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་སྤྱོད་པ་པོ་དང་། སྤྱོད་པར་འོས་པ་དང་།
en: Because all those who do the stopping, those who will stop, and the way the stopping happens cannot be apprehended in the perfection of wisdom.”

source: སྤྱད་པར་བྱ་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མི་དམིགས་པའི་ཕྱིར་དེ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡང་དེ་དག་སྤྱོད་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means a stopper, something that needs to be stopped, and the stopping to be done cannot be apprehended in this perfection of wisdom, so they cannot stop bodhisattvas practicing it. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ལ་ཇི་ལྟར་སྤྱད་པར་བྱ་སྟེ། འདི་ལྟ་སྟེ་མི་རྟག་པའི་དོན་དང་སྡུག་བསྔལ་བའི་དོན་དང་།
en: Furthermore, Subhūti, bodhisattva great beings should practice the reality of the perfection of wisdom—namely, they should practice the reality of impermanence, the reality of suffering, and the reality of selfless.”

source: བདག་མེད་པའི་དོན་ལ་སྤྱད་པར་བྱའོ་ཞེས་བྱ་བ་གསུམ་གྱིས་ཐམས་ཅད་ཀྱི་ཐུན་མོང་གི་དོན་བསྟན་ནས། སྡུག་བསྔལ་ཤེས་པའི་དོན་དང་། ཀུན་འབྱུང་བ་ཤེས་པའི་དོན་ནས། ཡོངས་སུ་འདྲིས་པ་ཤེས་པ་དང་། སྒྲ་ཇི་བཞིན་ཤེས་པའི་དོན་གྱི་བར་ཤེས་པ་བཅུ་གཅིག་པོ་འདི་རྣམས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་དེ་དག་གི་དོན་གང་ཡིན་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཡིན་ནོ་ཞེས་བསྟན་པའོ།
en: Having taught the condition shared in common by everything with these three, the realities of these eleven knowledges, from “the good of the knowledge of suffering, the good of the knowledge of origination,” up to “the good of the knowledge of mastery, and the good of the knowledge in accord with sound,” are the intrinsic nature of the perfection of wisdom, so they teach the good of the perfection of wisdom. “

source: །དོན་དང་ཚུལ་གྱིས་ཞེས་བྱ་བ་ལ་དོན་ནི་མི་རྟག་པ་ལ་སོགས་པའི་དོན་དེ་དག་གོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་སྔར་བསྟན་པ་དང་འོག་ནས་འབྱུང་བ་གང་ཡིན་པ་དེ་དག་ནི་ཚུལ་ལོ།
en: According to the reality and the mode”— “the reality” is those realities of impermanence and so on; “the mode” is the intrinsic nature of the perfection of wisdom dealt with below. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ལ་སྤྱོད་པས་ན། འདོད་ཆགས་བདག་གི་དོན་ཏམ། བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་དོན་དང་དོན་མ་ཡིན་པ་ཐ་དད་པར་རྣམ་པར་རྟོག་པ་ཡང་བསལ་བར་བྱའོ་ཞེས་བྱ་བ་སྟེ། དེ་བཞིན་ཉིད་ལ་དེ་ལྟ་བུར་འཇུག་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བསྟན་པའོ།
en: When… practicing this deep perfection of wisdom’s reality… they should not practice with the idea ‘greed is good for me’ or ‘is bad for me,’ ” and so on, is teaching that they should eliminate the conceptualization of good or bad as different, because in suchness the concern with such things does not exist. “

source: །གཟུགས་བདག་གི་དོན་ཞེས་སྤྱད་པར་མི་བྱའོ། །གཟུགས་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ་ཞེས་བྱ་བ་ནི་གཟུགས་དམིགས་པར་ལྟ་བ་ནི་དོན་མ་ཡིན་པའོ།
en: They should not practice with the idea ‘form is good for me’ or ‘form is bad for me.’ ”

source: །གཟུགས་དམིགས་སུ་མེད་པར་ལྟ་བ་ནི་དོན་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Viewing form falsely considered as a fact is “bad”; viewing form as unfindable is “good.” “

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་ཞེས་བྱ་བ་འདིས་འདི་སྐད་བསྟན་ཏེ། གང་ལ་ཡང་དོན་ཏམ་དོན་མ་ཡིན་པ་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི་ཆོས་གནས་པ་འདི་ངོ་བོ་ཉིད་ཁོ་ན་སྟེ། འདི་ལྟར་དེ་ལྟར་གནས་པའི་ཕྱིར་རོ་ཞེས་བསྟན་པའོ།
en: Whether the tathāgatas arise or whether the tathāgatas do not arise” is teaching that “the perfection of wisdom does not do anything good or bad to anything,” because “the establishment of dharmas,” just the intrinsic nature, thus “remains” as it is. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ལ་ཡང་མི་བྱེད་ཅེས་བྱ་བ་འདིས་ནི་འདི་སྐད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཐོང་ནས། འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་མ་མཐོང་བར་འགྱུར་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་བྱེད་པ་མ་ཡིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: The perfection of wisdom does not cause any compounded or uncompounded dharma at all” is teaching that because, having looked, the perfection of wisdom does not see any compounded or uncompounded dharma, it does not cause any dharma.

source: དེ་ཇི་ལྟར་དོན་ཏམ་དོན་མ་ཡིན་པ་འགའ་ཞིག་བྱེད་པར་འགྱུར་ཞེས་བསྟན་པའོ།
en: So how will the perfection of wisdom cause anything good or bad? “

source: །བཅོམ་ལྡན་འདས་འདུ་མ་བགྱིས་པ་འཕགས་པ་ཐམས་ཅད་ཀྱི་དོན་མ་ལགས་སམ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་འདུས་མ་བྱས་པ་མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་བགྱིད་པ་མ་ལགས་སམ་ཞེས་དགོངས་ནས་གསོལ་པའོ།
en: But Lord, the uncompounded is good for all noble… is it not?” It says this intending: does this perfection of wisdom not cause attainment of uncompounded nirvāṇa?

source: །ཕན་པའམ་གནོད་པ་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུས་མྱ་ངན་ལས་འདས་པ་ལ་ཕན་པའམ། གནོད་པ་གང་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ།
en: It “is not there to be good or bad for anything” means the perfection of wisdom, as a cause, is not in any way good or bad for nirvāṇa.

source: །དེ་ལ་ཡང་ནམ་མཁའི་དེ་བཞིན་ཉིད་ཀྱི་དཔེ་བསྟན་ཏོ།
en: It also teaches that through the simile of “the suchness of space.” “

source: །འདུས་མ་བགྱིས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབས་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་བགྱིད་དམ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྐྱེད་པར་བྱེད་པ་མ་ཡིན་ནམ་སྙམ་དུ་དགོངས་ནས་གསོལ་པའོ།
en: Lord, having trained in the uncompounded perfection of wisdom, do bodhisattva great beings not reach the knowledge of all aspects?” He asks this intending: does this perfection of wisdom not produce the knowledge of all aspects?

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་སྤྱོད་པའི་ཚེ་ཀུན་རྫོབ་ཏུ་དེ་ལྟ་ཡིན་ནོ་ཞེས་དེའི་ཚིག་ལ་རྗེས་སུ་ཡི་རང་ནས།
en: Having said that, the Lord rejoices in his statement because, when practicing, that is conventionally so.

source: གཉིས་ཀྱི་ཚུལ་གྱིས་ནི་མ་ཡིན་ནོ་ཞེས་དགག་པ་མཛད་དོ།
en: He then negates it, with “but not in a dualistic way.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གཅིག་སྟེ། ཐ་དད་པ་མ་ཡིན་ལ། གཉིས་སུ་མེད་པ་དེའི་ཕྱིར་ཕན་གདགས་པར་བྱ་བ་དང་། ཕན་འདོགས་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means the perfection of wisdom and the knowledge of all aspects are one, they are not different and are not two, therefore there is nothing that assists and nothing that is assisted.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་གཉིས་སུ་མ་མཆིས་པའི་ཆོས་གཉིས་སུ་མ་མཆིས་པའི་ཆོས་ཐོབ་པར་བགྱིད་དམ་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན།
en: What is intended by “Lord, does a nondual dharma reach a nondual dharma?”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ་ཞེས་གྲགས་པ་དེ་ལ།
en: It is well known that bodhisattvas reach the knowledge of all aspects with the perfection of wisdom as the cause.

source: ཅི་ངོ་བོ་ཉིད་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་འདིས་གཉིས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པར་འགྱུར་རམ། འོན་ཏེ་གཉིས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་བྱང་ཆུབ་སེམས་དཔས་གཉིས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པར་འགྱུར་ཞེས་རྣམ་པར་རྟོག་པ་གཉིས་ཞུས་པ་དང་།
en: In regard to that, he is asking about two possibilities—whether these bodhisattvas without an intrinsic nature reach a perfection of wisdom with a nondual intrinsic nature, or whether bodhisattvas with a dual intrinsic nature reach a perfection of wisdom with a nondual intrinsic nature.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གཉི་གར་ཡང་བརྗོད་དུ་མི་རུང་བའི་ཕྱིར་མ་གནང་ནས་འདི་སྐད་དུ་གཉིས་ཀྱི་ཆོས་སམ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱང་མི་དམིགས་ན་དེ་ལྟར་དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ་ཞེས་གསུངས་ཏེ།
en: The Lord does not assent because it is not suitable to be expressed as either. He says, “Because neither a dual dharma nor a nondual dharma can be apprehended, the knowledge of all aspects is thus reached by way of not apprehending anything at all.”

source: ཇི་ལྟར་ཆོས་འདི་དག་ཐམས་ཅད་གཉིས་ཀྱི་བདག་ཉིད་དམ། གཉིས་སུ་མེད་པའི་བདག་ཉིད་དུ་ཡང་དམིགས་སུ་མེད་པ་དེ་བཞིན་དུ། གཉིས་ཀྱི་ཆོས་དམིགས་སུ་མེད་པའི་ཚུལ་དང་། གཉིས་སུ་མེད་པའི་ཆོས་དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ཅེས་བྱའི་དེ་ལས་གཞན་པ་ནི་ཅུང་ཟད་ཀྱང་མེད་དོ།། །།
en: Just as all these dharmas cannot be apprehended as being constituted as dual or constituted as being nondual, similarly the knowledge of all aspects is reached by way of dharmas that cannot be apprehended as dual and dharmas that cannot be apprehended as nondual.

source: བམ་པོ་ཉི་ཤུ་ལྔ་པ།
en: Other than that, it does not happen at all.
